Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
lst= [3*i for i in range(1,11)]

In [12]:
series2 = pd.Series(lst)
print(series2)

0     3
1     6
2     9
3    12
4    15
5    18
6    21
7    24
8    27
9    30
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [52]:
data = [['Alice',25,'Female'],['Bob',30,'Male'],['Claire', 27,'Female']]

In [53]:
df3 = pd.DataFrame(data, columns=['Name', "Age",'Gender'])

In [54]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [55]:
print(df3.to_string(index=False))

  Name  Age Gender
 Alice   25 Female
   Bob   30   Male
Claire   27 Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### Pandas DataFrame is two-dimensional (2D) size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

### pandas.series are 1d array wherear dataframes are 2d arrays

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

df.drop() for deleting any row or column
eg. 
df.drop(1, axis=0) will delete row with index 1
df.drop(1, axis=1) will delete column with index 1

drop function is used when we need to delete a column or row from dataframe

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series>>>>    Value Mutable but not size Mutable

DataFrame>    Value Mutable and size Mutable

Panel>>>>>    Value Mutable and size Mutable

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [71]:
course = pd.Series(['DS','WD','JS'], name='course')
fee =pd.Series([1000,1000,10000],name='fee')
time= pd.Series(['9-3','12-6','3-9'], name='timings')

In [72]:
df7 = pd.concat([course,fee,time],axis=1)

In [73]:
df7

  course    fee timings
0     DS   1000     9-3
1     WD   1000    12-6
2     JS  10000     3-9